app/Http/Controllers/adminController.php

select * from `users` where `id` = 161 limit 1
select * from `users`
select * from `properties` where `id` = 0 limit 1
---
 public function index()
    {
      $auth=auth::user();
      $aData['dataC'] = dbsetting::getConnect($auth->id);

//dd(request()->getHost());
      //dd(request('code'));

//dd(auth()->id());
// dd('dddd');


       if(auth())
       {
//dd(auth()->user());

        $now = Carbon::now();
        $weekStartDate = $now->startOfWeek()->format('Y-m-d H:i');
        $weekEndDate = $now->endOfWeek()->format('Y-m-d H:i');
        $user = User::where('id',auth()->id())->first();
        $users= User::get();
        $user->hasRole('Admin');
       //$int = (int)$user->property_id;
//dd($users);
        //dd($user->hasRole('Housekeeper'));
      $property_name = property::where('id',$user->property_id)->first();