app/Http/Controllers/DailyController.php

       }

    //$metaname_id=$this->metaname_model;
    $metanamess = metaname::where('metanames.id',$metaname_id)->first();
---
select * from `metanames` where `metanames`.`id` = '1' limit 1


  // dd($assetID);

    $metanamesx = metaname::join('qns_appliedtos','qns_appliedtos.metaname_id','metanames.id')
     ->where('qns_appliedtos.department_id',$auth->department_id)
     ->select('metanames.id','metanames.metaname_name')
     ->groupby('metanames.id')
     ->get();
---
select `metanames`.`id`, `metanames`.`metaname_name` from `metanames` inner join `qns_appliedtos` on `qns_appliedtos`.`metaname_id` = `metanames`.`id` where `qns_appliedtos`.`department_id` = 5 group by `metanames`.`id`

     $metanames = metaname::join('qns_appliedtos','qns_appliedtos.metaname_id','metanames.id')
      ->where('qns_appliedtos.department_id',$auth->department_id)
      ->select('metanames.id','metanames.metaname_name')
      //->groupby('metanames.id')
      ->get();
---
select `metanames`.`id`, `metanames`.`metaname_name` from `metanames` inner join `qns_appliedtos` on `qns_appliedtos`.`metaname_id` = `metanames`.`id` where `qns_appliedtos`.`department_id` = 5

      // ->select('assets.id','assets.metaname_id','assets.asset_name','assets.property_id')
      // ->get();

      $assets = asset::where('assets.metaname_id',$metaname_id)
      ->where('assets.property_id',auth()->user()->property_id)
      ->select('assets.id','assets.metaname_id','assets.asset_name','assets.property_id')
      ->paginate(8);
---
select `assets`.`id`, `assets`.`metaname_id`, `assets`.`asset_name`, `assets`.`property_id` from `assets` where `assets`.`metaname_id` = 1 and `assets`.`property_id` = 1 limit 8 offset 0
select count(*) as aggregate from `assets` where `assets`.`metaname_id` = 1 and `assets`.`property_id` = 1


    if($asset_show->asset_show==1 && $date_time>$datet && $date_time_init!="00:00:00")
    {
    $update = asset::where('property_id',$auth->property_id)->update([
      'time_show'=>1,
      'asset_show'=>1,
    ]);
---
update `assets` set `time_show` = 1, `asset_show` = 1, `assets`.`updated_at` = '2025-03-03 10:38:18' where `property_id` = 2

    }
    }
    else{
    $update = asset::where('property_id',$auth->property_id)->update([
      'time_show'=>1,
      'asset_show'=>1
    ]);
---
update `assets` set `time_show` = 1, `asset_show` = 1, `assets`.`updated_at` = '2025-03-03 12:40:25' where `property_id` = 1

   //desc
   //dd($data[7]);
     //dd($data[6]);
   $updateqnsF = answer::where('property_id',$property_id)
   ->where('metaname_id',request('metaname_id'))
   ->where('asset_id',$asset_id)
    ->where('indicator_id',$data[1])
     ->where('section',$data[6])
    ->where('datex',$current_date)
    ->where('indicator_id',$data[1])
   ->update([
   'description'=>$value[0]
   ]);
---
update `answers` set `description` = 'Testyhyy', `answers`.`updated_at` = '2024-11-20 15:43:34' where `property_id` = '1' and `metaname_id` = '1' and `asset_id` = '5' and `indicator_id` = '1' and `section` = '3' and `datex` = '2024-11-20' and `indicator_id` = '1'