app/Http/Controllers/ManageController.php

select * from `departments` where `status` = 'Active' and `id` = 1 limit 1
---

      //dd(auth()->id());
      //Get Department name
         $departGetName= department::where('status','Active')
         ->where('id',$auth->department_id)->first();

select `assets`.`id`, `assets`.`metaname_id`, `assets`.`asset_name` from `assets` inner join `answers` on `answers`.`asset_id` = `assets`.`id` where `assets`.`metaname_id` = '1' and `answers`.`manager_checklist` != 'Cleared' group by `assets`.`asset_name`
select `metanames`.`id`, `metanames`.`metaname_name` from `user_activities` inner join `metanames` on `metanames`.`id` = `user_activities`.`activity_id` where `user_activities`.`sys_user_id` = 2 and `user_activities`.`status` = 'Active'
---


      //$assets = asset::where('assets.metaname_id',$metaname_id)
     $assets = asset::join('answers','answers.asset_id','assets.id')
     ->where('assets.metaname_id',$metaname_id)
     ->where('answers.manager_checklist','!=',"Cleared")
     ->groupby('assets.asset_name')
    ->select('assets.id','assets.metaname_id','assets.asset_name')
      ->get();
//dd($assets);

      $userMetanames = userActivity::join('metanames','metanames.id','user_activities.activity_id')
      ->where('user_activities.sys_user_id',auth()->id())
      ->where('user_activities.status','Active')
      ->select('metanames.id','metanames.metaname_name')
      ->get();

select `metanames`.`id`, `metanames`.`metaname_name` from `user_activities` inner join `metanames` on `metanames`.`id` = `user_activities`.`activity_id` where `user_activities`.`sys_user_id` = 2 and `user_activities`.`status` = 'Active'
---
        $userActitivities = userActivity::join('metanames','metanames.id','user_activities.activity_id')
        ->where('user_activities.sys_user_id',auth()->id())
        ->where('user_activities.status','Active')
        //->join('users','sales.user_id','users.id')
        ->select('metanames.id','metanames.metaname_name')
        ->get();

select `metanames`.`id`, `metanames`.`metaname_name` from `user_roles` inner join `activity_roles` on `activity_roles`.`role_id` = `user_roles`.`role_id` inner join `metanames` on `metanames`.`id` = `activity_roles`.`activity_id` where `user_roles`.`sys_user_id` = 2 and `activity_roles`.`status` = 'Active'
select `metanames`.`id`, `metanames`.`metaname_name` from `department_roles` inner join `activity_roles` on `activity_roles`.`role_id` = `department_roles`.`role_id` inner join `metanames` on `metanames`.`id` = `activity_roles`.`activity_id` where `department_roles`.`department_id` = 1 and `activity_roles`.`status` = 'Active'
---
        ->join('metanames','metanames.id','activity_roles.activity_id')
        ->where('user_roles.sys_user_id',auth()->id())
       ->where('activity_roles.status','Active')
        //->join('users','sales.user_id','users.id')
       ->select('metanames.id','metanames.metaname_name')
        ->get();

        $userActitivitiesff = departmentRole::join('activity_roles','activity_roles.role_id','department_roles.role_id')
        ->join('metanames','metanames.id','activity_roles.activity_id')
        ->where('department_roles.department_id',$auth->department_id)
       ->where('activity_roles.status','Active')
       ->select('metanames.id','metanames.metaname_name')
        ->get();

update `assets` set `time_show` = 1, `asset_show` = 1, `assets`.`updated_at` = '2024-11-08 11:40:15' where `property_id` = 1
---
      if($asset_show->asset_show==1 && $date_time>$datet && $date_time_init!="00:00:00")
      {
//dd('overtime');
        $update = asset::where('property_id',$auth->property_id)->update([
            'time_show'=>1,
            'asset_show'=>1,
        ]);

update `assets` set `time_show` = 1, `asset_show` = 1, `assets`.`updated_at` = '2025-03-06 13:17:42' where `property_id` = 1
---
        }
      }
      else{
          $update = asset::where('property_id',$auth->property_id)->update([
            'time_show'=>1,
            'asset_show'=>1
        ]);

select `assets`.`id`, `assets`.`property_id`, `assets`.`metaname_id`, `assets`.`asset_name` from `assets` where `assets`.`status` = 'Active' and `assets`.`time_show` = 1 and `assets`.`id` = '1' and `assets`.`asset_name` != '' and `assets`.`property_id` = 1 and `assets`.`metaname_id` in ('1') order by `assets`.`id` asc
---
//$assetID
//dd($asset_show);

       $pp = asset::where('assets.status','Active')
       ->where('assets.time_show',1)
         ->where('assets.id',request('asset_model'))
         ->where('assets.asset_name','!=',"")
         ->where('assets.property_id',$auth->property_id)
         ->whereIn('assets.metaname_id',[$metaname_id])
         ->select('assets.id','assets.property_id','assets.metaname_id','assets.asset_name')
         ->orderBy('assets.id')->get();

select * from `qns_appliedtos` where `qns_appliedtos`.`status` = 'Active' group by `qns_appliedtos`.`metaname_id`, `qns_appliedtos`.`section`
---
          $qns=collect($qns);

             //dd($qns);
          $sections=qnsAppliedto::where('qns_appliedtos.status','Active')
          ->groupby('qns_appliedtos.metaname_id')
          ->groupby('qns_appliedtos.section')
          ->get();

select * from `answers` where `answer` != 'Yes' and `manager_checklist` != 'Cleared' and `property_id` = 1 and `status` = 'Active'
select * from `metanames` where `metanames`.`id` = '1' limit 1
---
      $property_id=$auth->property_id;
      $metanameCollects=collect($metanames);
      //Count Questions
      $qnsCount=answer::where('answer','!=','Yes')
      ->where('manager_checklist','!=','Cleared')
      ->where('property_id',$auth->property_id)
       ->where('status','Active')
      ->get();

//dd(request('metaname_model'));
    $metanamess = metaname::where('metanames.id',$metaname_id)->first();