app/Http/Controllers/profileController.php

select * from `my_companies` where `id` = 80 limit 1
---
    public function index()
    {
     $auth=auth::user();
     $aData['dataC'] = dbsetting::getConnect($auth->id);

     if(!is_null($auth->company_id))
     {
        $profile = myCompany::on('clientdb')->where('id',$auth->company_id)->first();

insert into `users` (`name`, `department_id`, `email`, `password`, `status`, `user_id`, `updated_at`, `created_at`) values ('waw 1122', 1, 'ty@mailinator.com', '$2y$10$Qp5Bx/enZF4LuN3P36aNuu7hkmHJv1Uv6.aLimTseNJLVY1P5w5g.', 'Active', 0, '2025-02-18 15:58:52', '2025-02-18 15:58:52')
insert into `my_companies` (`company_name`, `logo`, `tin`, `vrn`, `phone_number`, `email`, `address`, `district`, `region`, `first_name`, `last_name`, `code`, `status`, `user_id`, `updated_at`, `created_at`) values ('Plato Shepherd', 'Starlink_1739883532.jpeg', '333', '444', '32322', 'ty@mailinator.com', 'rate e', 'Magni necessitatibus', 'Soluta recusandae I', 'waw', '1122', '000054', 'Active', 148, '2025-02-18 15:58:52', '2025-02-18 15:58:52')
insert into `user_properties` (`sys_user_id`, `property_id`, `status`, `user_id`, `updated_at`, `created_at`) values (148, 61, 'Active', 148, '2025-02-18 15:58:52', '2025-02-18 15:58:52')
---

     //Insert to user
 //Insert to user
        $userReg = user::Create([
         'name'=>request('first_name').' '.request('last_name'),
         'department_id'=>1, //$department->id
         // 'property_id'=>$insetqnsy->id,
          'email'=>request('email'),
          'password'=>Hash::make(request('password')),
          'status'=>'Active',
           'user_id'=>0
         ]);

 //dd('prints');
  $insetqnsy = myCompany::Create([
           'company_name'=>request('business_name'),
            'logo'=>$imageToStore,
           'tin'=>request('tin'),
           'vrn'=>request('vrn'),
           'phone_number'=>request('phone_number'),
           'email'=>request('email'),
           'address'=>request('address'),

            'district'=>request('district'),
             'region'=>request('region'),

           'first_name'=>request('first_name'),
           'last_name'=>request('last_name'),
           'code'=>request('code'),
           'status'=>'Active',
           'user_id'=>$userReg->id
              ]);

         $userSiteReg = userProperty::Create([
         'sys_user_id'=>$userReg->id,
         'property_id'=>$insetqnsy->id,
         'status'=>'Active',
         'user_id'=>$userReg->id
         ]);