app/Http/Controllers/PropertyController.php

      //->where('set_indicators.qns','!=',"")
     ->whereBetween('answers.datex',[$start_date, $end_date])

   ->select('answers.id','answers.property_id','answers.indicator_id','answers.metaname_id','answers.asset_id','answers.opt_answer_id','answers.answer','answers.photo','answers.description','answers.datex as Date','answers.answer_label','metanames.metaname_name','assets.asset_name','properties.property_name','set_indicators.qns','users.name as PostedBy')
   ->orderBy('set_indicators.id')
	 ->get();
---
select `answers`.`id`, `answers`.`property_id`, `answers`.`indicator_id`, `answers`.`metaname_id`, `answers`.`asset_id`, `answers`.`opt_answer_id`, `answers`.`answer`, `answers`.`photo`, `answers`.`description`, `answers`.`datex` as `Date`, `answers`.`answer_label`, `metanames`.`metaname_name`, `assets`.`asset_name`, `properties`.`property_name`, `set_indicators`.`qns`, `users`.`name` as `PostedBy` from `answers` inner join `properties` on `answers`.`property_id` = `properties`.`id` inner join `set_indicators` on `answers`.`indicator_id` = `set_indicators`.`id` inner join `users` on `answers`.`user_id` = `users`.`id` inner join `assets` on `answers`.`asset_id` = `assets`.`id` inner join `optional_answers` on `answers`.`opt_answer_id` = `optional_answers`.`id` inner join `metanames` on `answers`.`metaname_id` = `metanames`.`id` where `answers`.`property_id` = '1' and `answers`.`indicator_id` = `optional_answers`.`indicator_id` and `metanames`.`metaname_name` in ('Room', 'Dinning Room', 'Kitchen', 'Light', 'Swimming Pool', 'Garden', 'Store', 'Garage', 'Fance', 'Entree', 'Bathroom', 'Toilet', 'Furniture', 'Lodge', 'Water supply system', 'Sewer system', 'Electrical supply system', 'Staff', 'Wake-up Trays', 'Managers', 'Reception') and `optional_answers`.`answer_classification` in ('Good', 'Bad', 'Maintenance-low', 'Maintenance-medium', 'Maintenance-high') and `answers`.`datex` between '2024-10-15 00:00:00' and '2024-11-13 23:59:00' order by `set_indicators`.`id` asc