app/Http/Controllers/reportController.php

select * from `departments` where `id` = 1 limit 1
---
    public function weeklyReport(Request $request,$id,$status){
$auth=auth::user();
  $aData['dataC'] = dbsetting::getConnect($auth->id);
$property_id=$id;

///dd(request('metaname_id'));
$depart=department::on('clientdb')->where('id',$auth->department_id)->first();

select * from `departments` where `id` = 1 limit 1
---
public function monthlyReport(Request $request,$id,$status){
$auth=auth::user();
  $aData['dataC'] = dbsetting::getConnect($auth->id);
$property_id=$id;
$depart=department::on('clientdb')->where('id',$auth->department_id)->first();