app/Http/Controllers/UserRegisterController.php

    public function edit(request $request,$id)
    {
        $user = user::where('id',$id)
               ->update([
                'status'=>"Inactive",
                 'user_id'=>auth()->id()

              ]);
---
update `users` set `status` = 'Inactive', `user_id` = 2, `users`.`updated_at` = '2024-11-11 14:54:06' where `id` = '83'