app/Http/Controllers/usersPermissionController.php

    public function index()
    {
         $auth=auth::user();

         $users= User::get();
            $userRoles = User::join('user_roles','users.id','user_roles.sys_user_id')
        ->join('roles','user_roles.role_id','roles.id')
        ->where('user_roles.status','Active')
        ->select('roles.name as role_name','user_roles.sys_user_id as sys_user_id','user_roles.id as arole_id','users.*')
        ->get();


  // $permissions = userProperty::join('properties','user_properties.property_id','properties.id')
  //      ->where('user_properties.status','Active')
  //       ->select('properties.id as id','user_properties.sys_user_id as model_id','properties.property_name as permission_name')
  //       ->get();

 $permissions = User::join('properties','users.property_id','properties.id')
       ->where('users.status','Active')
        ->select('properties.id as id','users.id as model_id','properties.property_name as permission_name')
        ->get();

     //dd($permissions);
        $permit = property::get();
        $roles = Role::get();
        //$limitation = myPayment::latest()->first();

//The line must not moved
  $aData['dataC'] = dbsetting::getConnect($auth->id);
   $departments= department::get();
---
select * from `users`
select `roles`.`name` as `role_name`, `user_roles`.`sys_user_id` as `sys_user_id`, `user_roles`.`id` as `arole_id`, `users`.* from `users` inner join `user_roles` on `users`.`id` = `user_roles`.`sys_user_id` inner join `roles` on `user_roles`.`role_id` = `roles`.`id` where `user_roles`.`status` = 'Active'
select `properties`.`id` as `id`, `users`.`id` as `model_id`, `properties`.`property_name` as `permission_name` from `users` inner join `properties` on `users`.`property_id` = `properties`.`id` where `users`.`status` = 'Active'
select * from `properties`
select * from `roles`