app/Models/dbsetting.php

select * from `dbconnects` where `user_id` = 11 limit 1
---
    public static function getConnect($n){
              $valueDB=DB::table('dbconnects')->where('user_id',$n)->first();