app/Providers/AppServiceProvider.php

select * from `users`
select * from `dbconnects` where `user_id` = 2 limit 1
---
    public function boot()
    {
       $userCount=0;
       Paginator::useBootstrap();


         // Using view composer to set following variables globally
           view()->composer('*',function($view) {
  // $view->with('userCount', Auth::user());
  $view->with('user', Auth::user());
  //$aData['dataC'] = dbsetting::getConnect(Auth::user()->id);
   //$view->with('user_qnsCountxx', dbconnect::where('user_id',$$view->user->id))->first();


             if($view->user !=NULL)
             {
              //dd('not null');
               $property_id=$view->user->property_id;
               $company_id=$view->user->company_id;

               $valueDB=DB::table('dbconnects')->where('user_id',Auth::user()->id)->first();

                 //$aData['dataC'] = dbsetting::getConnect(Auth::user()->id);
                 //$view->with('user_qnsCountxx', dbconnect::where('user_id',$$view->user->id))->first();
    //dd($view->user);

                //DB::purge('mysql');
                   Config::set('database.connections.mysql.host',$valueDB->host);

select * from `users`
select `properties`.`property_name` from `users` inner join `properties` on `users`.`property_id` = `properties`.`id` limit 1
select * from `answers` where `answer` != 'Yes' and `manager_checklist` != 'Cleared' and `property_id` = 1 and `status` = 'Active'
---
            // $view->with('userx', User::all());


             $view->with('userx', User::get());
            $view->with('qnsCountx', User::join('properties','users.property_id','properties.id')
            ->select('properties.property_name')->first());

            $view->with('qnsCount', answer::where('answer','!=','Yes')
            ->where('manager_checklist','!=','Cleared')
            ->where('property_id',$property_id)
             ->where('status','Active')
            ->get());

select * from `my_companies` where `id` is null and `status` = 'Active' limit 1
---
            //->select('properties.property_name')->first());
             //$view->with('qnsCount', collect($qnsCount));

             $view->with('company', myCompany::where('id',$company_id)->where('status','Active')->first());